cf/InformationRegisters/ВнешнееОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВнешнееОборудование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВнешнееОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ВнешнееОборудование/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Структура = Новый Структура;Для Каждого Строка Из Настройки Цикл Структура.Вставить(Строка.Настройка, Строка.Значение); КонецЦикла;
	ТекущийОбъект.Настройки = ЗначениеВСтрокуВнутр(Структура);
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Запись.Оборудование.Пустая() Тогда ПрочитатьНастройки(); КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьНастройкиНаСервере(ИмяКомпьютера, ВсеНастройки)
	
	ТекущиеНастройки = ВнешнееОборудованиеСервер.ПолучитьНастройкиОборудования(Запись.Оборудование, ИмяКомпьютера);
	Настройки.Очистить();
	
	Для Каждого Элемент Из ВсеНастройки Цикл
		
		НовСтрока = Настройки.Добавить();
		НовСтрока.Настройка = Элемент.Ключ;
		НовСтрока.Значение 	= ?(ТекущиеНастройки = Неопределено, Элемент.Значение, ТекущиеНастройки[Элемент.Ключ]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройки()

	Если Запись.Оборудование.Пустая() Тогда
		Настройки.Очистить();
	Иначе
		ПрочитатьНастройкиНаСервере(Запись.ИмяКомпьютера, ВнешнееОборудование.ПолучитьНачальныеНастройки(Запись.Оборудование));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	
	ПрочитатьНастройки();
	
КонецПроцедуры
&НаКлиенте
Процедура ИмяКомпьютераПриИзменении(Элемент)
	
	ПрочитатьНастройки();
	
КонецПроцедуры
&НаКлиенте
Процедура ИмяКомпьютераОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	#Если Не ВебКлиент Тогда
		Запись.ИмяКомпьютера = ИмяКомпьютера();
		ПрочитатьНастройки();
	#КонецЕсли
	
КонецПроцедуры
